export const data = [
  [
    {
      id: "مراجع البلاغات",
    },
    {
      id: "مدقق البلاغات",
    },
    {
      id: "مدقق الحسابات",
    },
  ],
  [
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "شعبة مكافحة المخدرات بالخرج",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "شعبة مكافحة المخدرات بالدواومي",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "قسم مكافحة المخدرات بعفيف",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالدرعية",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالسيبل",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالأفلاج",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالثوفوية",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمطار الرياض",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمستشفى الأمل بالرياض",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "قسم مكافحة المخدرات بالرياض",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالرياض",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بجدة",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمكة المكرمة",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "قسم مكافحة المخدرات بالمدينة المنورة",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالدمام",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالخبر",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالشرقية",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "قسم مكافحة المخدرات بالقصيم",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالاحساء",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالجوف",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بتبوك",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بعرعر",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بنجران",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالباحة",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بجازان",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالقريات",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالحائط",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالزلفي",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بالخرج",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
    },
  ],
  [
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
      user: "محمد بن خالد السليمان",
    },
  ],
  [
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
    },
  ],
  [
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
      user: "محمد بن خالد السليمان",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
      user: "محمد بن خالد السليمان",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
      user: "محمد بن خالد السليمان",
    },
    {
      id: "الإدارة العامة للشرطة الدولية",
      department: "وحدة مكافحة المخدرات بمحايل",
      user: "محمد بن خالد السليمان",
    },
  ],
];

export const columns = [
  [
    {
      title: "الصلاحيات",
      dataIndex: "id",
      key: "id",
    },
  ],
  [
    {
      title: "الادارة",
      dataIndex: "id",
      key: "id",
    },
    {
      title: "الاقسام",
      dataIndex: "department",
      key: "department",
    },
  ],

  [
    {
      title: "الرئيسي",
      dataIndex: "id",
      key: "id",
    },
    {
      title: "الفرعى",
      dataIndex: "id",
      key: "id",
    },
  ],

  [
    {
      title: "الادارات",
      dataIndex: "id",
      key: "id",
    },
  ],

  [
    {
      title: "الادارة",
      dataIndex: "id",
      key: "id",
    },
    {
      title: "الاقسام",
      dataIndex: "department",
      key: "department",
    },
    {
      title: "المستخدمين",
      dataIndex: "user",
      key: "user",
    },
  ],
];

//   const columns = [
//     {
//       title: "الادارة",
//       dataIndex: "id",
//       key: "id",
//     },
//     {
//       title: "الاقسام",
//       dataIndex: "department",
//       key: "department",
//     },
//     {
//       title: "الفعاليات",
//       key: "actions",
//       render: () => (
//         <div className="flex justify-center gap-4">
//           <button className="text-md flex items-center gap-3 ">
//             <EyeOutlined /> {"عرض"}
//           </button>
//           <button className="text-md flex items-center gap-3 ">
//             <EditOutlined /> {"تعديل"}
//           </button>
//         </div>
//       ),
//     },
//   ];
